In [2]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt 
import warnings

warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv('salaries.csv')
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,EN,FT,Data Quality Analyst,60000,GBP,75949,GB,0,GB,M
1,2025,EN,FT,Data Quality Analyst,48000,GBP,60759,GB,0,GB,M
2,2025,SE,FT,Applied Scientist,266000,USD,266000,US,0,US,M
3,2025,SE,FT,Applied Scientist,204000,USD,204000,US,0,US,M
4,2025,SE,FT,Data Scientist,291000,USD,291000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
141561,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
141562,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
141563,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
141564,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
141565,2021,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

In [62]:
df_usd = df.drop(['salary',	'salary_currency','employee_residence'],axis=1)
df_usd.shape

(141566, 8)

In [63]:
df_usd.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2025,EN,FT,Data Quality Analyst,75949,0,GB,M
1,2025,EN,FT,Data Quality Analyst,60759,0,GB,M
2,2025,SE,FT,Applied Scientist,266000,0,US,M
3,2025,SE,FT,Applied Scientist,204000,0,US,M
4,2025,SE,FT,Data Scientist,291000,0,US,M

In [64]:
X = df_usd.drop(['salary_in_usd'],axis=1)
Y = df_usd['salary_in_usd']
X

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,2025,EN,FT,Data Quality Analyst,0,GB,M
1,2025,EN,FT,Data Quality Analyst,0,GB,M
2,2025,SE,FT,Applied Scientist,0,US,M
3,2025,SE,FT,Applied Scientist,0,US,M
4,2025,SE,FT,Data Scientist,0,US,M
...,...,...,...,...,...,...,...
141561,2020,SE,FT,Data Scientist,100,US,L
141562,2021,MI,FT,Principal Data Scientist,100,US,L
141563,2020,EN,FT,Data Scientist,100,US,S
141564,2020,EN,CT,Business Data Analyst,100,US,L
141565,2021,SE,FT,Data Scientist,50,IN,L

In [65]:
X.drop_duplicates(inplace=True)

In [66]:
X.shape

(5430, 7)

In [68]:
X.isna().sum()

work_year           0
experience_level    0
employment_type     0
job_title           0
remote_ratio        0
company_location    0
company_size        0
dtype: int64

In [69]:
X.describe()

         work_year  remote_ratio
count  5430.000000   5430.000000
mean   2024.044199     37.523020
std       1.133832     46.930431
min    2020.000000      0.000000
25%    2024.000000      0.000000
50%    2024.000000      0.000000
75%    2025.000000    100.000000
max    2025.000000    100.000000

In [71]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5430 entries, 0 to 141565
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         5430 non-null   int64
 1   experience_level  5430 non-null   object
 2   employment_type   5430 non-null   object
 3   job_title         5430 non-null   object
 4   remote_ratio      5430 non-null   int64
 5   company_location  5430 non-null   object
 6   company_size      5430 non-null   object
dtypes: int64(2), object(5)
memory usage: 339.4+ KB

In [72]:
X.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [73]:
X.head()

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,2025,EN,FT,Data Quality Analyst,0,GB,M
2,2025,SE,FT,Applied Scientist,0,US,M
4,2025,SE,FT,Data Scientist,0,US,M
8,2025,SE,FT,Data Scientist,100,US,M
16,2025,MI,FT,Data Scientist,0,US,M

In [74]:
X['experience_level'].value_counts()

experience_level
SE    2180
MI    1870
EN    1061
EX     319
Name: count, dtype: int64

In [75]:
X['employment_type'].value_counts()

employment_type
FT    5111
CT     170
PT     133
FL      16
Name: count, dtype: int64

In [76]:
X['job_title'].value_counts()

job_title
Data Scientist               377
Data Analyst                 320
Data Engineer                320
Machine Learning Engineer    201
Software Engineer            135
                            ...
Master Data Specialist         1
Data Science Tech Lead         1
Marketing Data Engineer        1
Principal Data Architect       1
Cloud Data Architect           1
Name: count, Length: 410, dtype: int64

In [77]:
X['work_year'].value_counts()

work_year
2025    2323
2024    1924
2023     606
2022     323
2021     185
2020      69
Name: count, dtype: int64

In [78]:
X['remote_ratio'].value_counts()

remote_ratio
0      3238
100    1883
50      309
Name: count, dtype: int64

In [79]:
X['company_size'].value_counts()

company_size
M    4576
L     665
S     189
Name: count, dtype: int64

In [80]:
X['company_location'].value_counts()

company_location
US    2494
CA     595
GB     499
DE     175
AU     127
      ...
IR       1
BS       1
IQ       1
CN       1
MD       1
Name: count, Length: 96, dtype: int64